Tekla Open API Reference for Tekla Structures 2025
PlacingTypes.BaseLinePlacing Method
 The object is placed using a line as a reference. This will thus define the object's X-axis along that line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PlacingBase BaseLinePlacing(
	Point StartPoint,
	Point EndPoint
)
Public Shared Function BaseLinePlacing (
	StartPoint As Point,
	EndPoint As Point
) As PlacingBase
Parameters
StartPoint
Type: Tekla.Structures.Geometry3d.Point
The first point of the line.
EndPoint
Type: Tekla.Structures.Geometry3d.Point
The second point of the line.
Return Value
Type: PlacingBase
A new base line placing instance.
See Also
Reference
PlacingTypes Class
Tekla.Structures.Drawing Namespace